In [17]:
import numpy as np
import pandas as pd

In [18]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'may'],
           'last_name' : ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age': [42, np.nan, 36, 24, 73],
           'postestscore': [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'may'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'postestscore': [25, nan, nan, 62, 72]}

In [19]:
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  postestscore
0      jason    miller  42.0          25.0
1        NaN       NaN   NaN           NaN
2       tina       ali  36.0           NaN
3       jake    milner  24.0          62.0
4        may    coozer  73.0          72.0

In [20]:
df.index = ['A', 'B', 'C', 'D', 'E']
df

  first_name last_name   age  postestscore
A      jason    miller  42.0          25.0
B        NaN       NaN   NaN           NaN
C       tina       ali  36.0           NaN
D       jake    milner  24.0          62.0
E        may    coozer  73.0          72.0

In [23]:
df['age'] = df['age'].apply(lambda x : x + 10)
df

  first_name last_name   age  postestscore
A      jason    miller  52.0          25.0
B        NaN       NaN   NaN           NaN
C       tina       ali  46.0           NaN
D       jake    milner  34.0          62.0
E        may    coozer  83.0          72.0

In [32]:
df.loc['A', ['age', 'postestscore']]

age             52.0
postestscore    25.0
Name: A, dtype: object

In [40]:
df.loc[df['first_name'] == 'may']

  first_name last_name   age  postestscore
E        may    coozer  83.0          72.0

In [42]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?

df.loc[df['age'] >= 40]['postestscore'].mean()

48.5

In [43]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name   age  postestscore  address
A      jason    miller  52.0          25.0    seoul
B        NaN       NaN   NaN           NaN  incheon
C       tina       ali  46.0           NaN  daejeon
D       jake    milner  34.0          62.0    pusan
E        may    coozer  83.0          72.0  gwangju

In [45]:
df.columns = ['fn', 'ln', 'age', 'pres', 'add']
df

      fn      ln   age  pres      add
A  jason  miller  52.0  25.0    seoul
B    NaN     NaN   NaN   NaN  incheon
C   tina     ali  46.0   NaN  daejeon
D   jake  milner  34.0  62.0    pusan
E    may  coozer  83.0  72.0  gwangju

In [46]:
df.rename(columns = {'add' : 'address'}, inplace = True)
df

      fn      ln   age  pres  address
A  jason  miller  52.0  25.0    seoul
B    NaN     NaN   NaN   NaN  incheon
C   tina     ali  46.0   NaN  daejeon
D   jake  milner  34.0  62.0    pusan
E    may  coozer  83.0  72.0  gwangju

In [47]:
# column 또는 row를 삭제

In [54]:

df

      fn      ln   age  pres
A  jason  miller  52.0  25.0
B    NaN     NaN   NaN   NaN
C   tina     ali  46.0   NaN
D   jake  milner  34.0  62.0
E    may  coozer  83.0  72.0

In [56]:
df.drop('C')

      fn      ln   age  pres
A  jason  miller  52.0  25.0
B    NaN     NaN   NaN   NaN
D   jake  milner  34.0  62.0
E    may  coozer  83.0  72.0

In [58]:
df.drop(['ln', 'pres'], axis = 1)

      fn   age
A  jason  52.0
B    NaN   NaN
C   tina  46.0
D   jake  34.0
E    may  83.0

In [64]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Giant', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df.head(5)

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [63]:
df.groupby('Team')['Rank'].mean()

Team
Devils    2.500000
Giant     4.000000
Kings     1.666667
Riders    1.750000
Royals    2.500000
Name: Rank, dtype: float64

In [65]:
# 연도별 최고 점수는

df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [66]:
# 팀별, 연도별 포인트 평균은?

df.groupby(['Team', 'Year'])['Points'].mean()

Team    Year
Devils  2014    863.0
        2015    673.0
Giant   2015    812.0
Kings   2014    741.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
Name: Points, dtype: float64